In [12]:
#Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe

# importing pandas as pd 
import pandas as pd
  
WD = pd.date_range(start ='1-1-2019', end ='31-12-2019', freq ='W', tz = 'Asia/Calcutta') 
  
for val in WD: 
    print(val)

2019-01-06 00:00:00+05:30
2019-01-13 00:00:00+05:30
2019-01-20 00:00:00+05:30
2019-01-27 00:00:00+05:30
2019-02-03 00:00:00+05:30
2019-02-10 00:00:00+05:30
2019-02-17 00:00:00+05:30
2019-02-24 00:00:00+05:30
2019-03-03 00:00:00+05:30
2019-03-10 00:00:00+05:30
2019-03-17 00:00:00+05:30
2019-03-24 00:00:00+05:30
2019-03-31 00:00:00+05:30
2019-04-07 00:00:00+05:30
2019-04-14 00:00:00+05:30
2019-04-21 00:00:00+05:30
2019-04-28 00:00:00+05:30
2019-05-05 00:00:00+05:30
2019-05-12 00:00:00+05:30
2019-05-19 00:00:00+05:30
2019-05-26 00:00:00+05:30
2019-06-02 00:00:00+05:30
2019-06-09 00:00:00+05:30
2019-06-16 00:00:00+05:30
2019-06-23 00:00:00+05:30
2019-06-30 00:00:00+05:30
2019-07-07 00:00:00+05:30
2019-07-14 00:00:00+05:30
2019-07-21 00:00:00+05:30
2019-07-28 00:00:00+05:30
2019-08-04 00:00:00+05:30
2019-08-11 00:00:00+05:30
2019-08-18 00:00:00+05:30
2019-08-25 00:00:00+05:30
2019-09-01 00:00:00+05:30
2019-09-08 00:00:00+05:30
2019-09-15 00:00:00+05:30
2019-09-22 00:00:00+05:30
2019-09-29 00:00:00+05:30
2019-10-06 00:00:00+05:30
2019-10-13 00:00:00+05:30
2019-10-20 00:00:00+05:30
2019-10-27 00:00:00+05:30
2019-11-03 00:00:00+05:30
2019-11-10 00:00:00+05:30
2019-11-17 00:00:00+05:30
2019-11-24 00:00:00+05:30
2019-12-01 00:00:00+05:30
2019-12-08 00:00:00+05:30
2019-12-15 00:00:00+05:30
2019-12-22 00:00:00+05:30
2019-12-29 00:00:00+05:30

In [19]:
#Given Pandas series , height = [23,42,55] and weight = [71,32,48] . Create a dataframe with height and weight as column names

df1 = pd.DataFrame({'height': [23, 42, 55], 'weight':[71, 32, 48]})
df1

   height  weight
0      23      71
1      42      32
2      55      48

In [23]:
#How to get the items of series A not present in series B .From ser1 remove items present in ser2

serA = pd.Series([2, 3, 4, 5])
serB = pd.Series([5, 6, 7, 8])

serA[~serA.isin(serB)]

0    2
1    3
2    4
dtype: int64

In [78]:
#Titanic Dataset

df10 = pd.read_csv(r'D:\Learning\End to End Data Science\Data Sets\titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
#Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset
df10.Age.agg(min)

0.42

In [66]:
df10.Age.describe(percentiles=[0.25])

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
max       80.000000
Name: Age, dtype: float64

In [54]:
df10.Age.median()

28.0

In [67]:
df10.Age.agg(max)

80.0

In [69]:
df10.Age.describe(percentiles=[0.75])

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [72]:
#How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset

df10.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [75]:
#Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset

df10.Embarked.value_counts()
df10.Embarked.replace(['Q'],'Other')

0          S
1          C
2          S
3          S
4          S
5      Other
6          S
7          S
8          S
9          C
10         S
11         S
12         S
13         S
14         S
15         S
16     Other
17         S
18         S
19         C
20         S
21         S
22     Other
23         S
24         S
25         S
26         C
27         S
28     Other
29         S
       ...
861        S
862        S
863        S
864        S
865        S
866        C
867        S
868        S
869        S
870        S
871        S
872        S
873        S
874        C
875        C
876        S
877        S
878        S
879        C
880        S
881        S
882        S
883        S
884        S
885    Other
886        S
887        S
888        S
889        C
890    Other
Name: Embarked, Length: 891, dtype: object

In [87]:
#Bin the price column in titanic data set into 5 equal groups and get counts of each bin
pd.qcut(df['Fare'], q=5, precision=0).value_counts()

(8.0, 10.0]      184
(22.0, 40.0]     180
(-1.0, 8.0]      179
(40.0, 512.0]    176
(10.0, 22.0]     172
Name: Fare, dtype: int64

In [91]:
#Count the number of missing values in each column?
df10.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [107]:
#Get the row number of the 5th largest value in the Age column of titanic dataset?

df10.nlargest(5,['Age'])
df10.Age.nlargest(5).iloc[-1]

70.5

In [115]:
#Normalize all columns in a dataframe?

In [116]:
#Get the indices of items of ser2 in ser1 as a list.
ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
ser2 = pd.Series([1,3,10,13])

In [117]:
# How to convert a series of date-strings to a timeseries?
df11 = ['01Jan2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20']

In [119]:
#Get the day of month, week number, day of year and day of week from ser.
#ser = pd.series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [126]:
#Compute the euclidean distance between series (points) p and q, without using a packaged formula.

#Desired output = 18.165

import numpy as np

p = pd.Series([1,2,3,4,5,6,7,8,9,10])
q = pd.Series([10,9,8,7,6,5,4,3,2,1])
print (np.linalg.norm(p-q))

18.16590212458495

In [140]:
#How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)

data = pd.date_range('2000-01-01', periods = 10, freq = 'W-FRI')
print (data)

DatetimeIndex(['2000-01-07', '2000-01-14', '2000-01-21', '2000-01-28',
               '2000-02-04', '2000-02-11', '2000-02-18', '2000-02-25',
               '2000-03-03', '2000-03-10'],
              dtype='datetime64[ns]', freq='W-FRI')

In [ ]:
#Import every 50th row of BostonHousing dataset as a dataframe.